import pandas as pd
columns = ["ФИО", "Адрес", "Телефон", "Дата рождения"]# Создаем список с названиями колонок
users_list = [{"ФИО": "Лёха Пупкин", "Адрес": "Москва", "Телефон": "111-111", "Дата рождения": "12.01.1990"}, {"ФИО": "Тоха Чёрный", "Адрес": "Сочи", "Телефон": "222-222", "Дата рождения": "17.05.1995"}]# Создаем список словарей (наши пользователи)

df = pd.DataFrame(users_list, columns=columns)# Создаем саму таблицу из нашего списка

print("Исходная таблица")
print(df)


print("Добавление данных")
new_fio = input("Введите ФИО: ")# Запрашиваем данные для нового пользователя
new_address = input("Введите адрес: ")
new_phone = input("Введите телефон: ")
new_birthday = input("Введите дату рождения: ")

df.loc[len(df)] = [new_fio, new_address, new_phone, new_birthday]# Записываем новые данные в следующую пустую строку

print("Таблица после добавления:")
print(df)


print("Редактирование данных")
row_index = int(input("Введите номер строки для редактирования: "))# Запрашиваем у пользователя, что именно он хочет изменить
column_name = input("Введите название колонки (ФИО, Адрес, Телефон или Дата рождения): ")
new_value = input("Введите новое значение: ")

df.loc[row_index, column_name] = new_value# Находит нужную ячейку и записывает туда новое значение

print("Таблица после изменения:")
print(df)


print("Удаление данных")
delete_index = int(input("Введите номер строки для удаления: "))# Запрашиваем номер строки для удаления

df.drop(delete_index, inplace=True)# Удаляем строку по её номеру
df.reset_index(drop=True, inplace=True)# Сбрасываем индексы, чтобы они снова шли по порядку

print("Финальная таблица после удаления:")
print(df)