import pandas as pd

# 1. Инициализация и создание таблицы
cols = ["ФИО", "Адрес", "Телефон", "Дата рождения"]
df = pd.DataFrame(columns=cols)

p1 = {"ФИО": "Иванов Иван", "Адрес": "Москва", "Телефон": "111-111", "Дата рождения": "01.01.1990"}
df = pd.concat([df, pd.DataFrame([p1])], ignore_index=True)

p2 = {"ФИО": "Петрова Анна", "Адрес": "Сочи", "Телефон": "222-222", "Дата рождения": "05.05.1995"}
df = pd.concat([df, pd.DataFrame([p2])], ignore_index=True)

print("Исходная таблица")
print(df)


# 2. Интерактивное изменение через терминал
print("Редактирование данных")
row_index = int(input("Введите номер строки для ИЗМЕНЕНИЯ (индекс): "))
column_name = input("Введите название колонки (ФИО, Адрес, Телефон или Дата рождения): ")
new_value = input("Введите новое значение: ")

df.loc[row_index, column_name] = new_value

print("Таблица после изменения")
print(df)


# 3. Интерактивное удаление строки (Вместо удаления 0-й строки)
print("Удаление данных")
delete_index = int(input("Введите номер строки для УДАЛЕНИЯ (индекс): "))

# Удаляем выбранную строку и сбрасываем индексы, чтобы они шли по порядку (0, 1, 2...)
df = df.drop(delete_index).reset_index(drop=True)

print("Финальная таблица после удаления")
print(df)