import pandas as pd
# Создаем список с названиями колонок
columns = ["ФИО", "Адрес", "Телефон", "Дата рождения"]

# Создаем список словарей (наши пользователи)
users_list = [{"ФИО": "Иванов Иван", "Адрес": "Москва", "Телефон": "111-111", "Дата рождения": "01.01.1990"}, {"ФИО": "Петрова Анна", "Адрес": "Сочи", "Телефон": "222-222", "Дата рождения": "05.05.1995"}]

# Создаем саму таблицу из нашего списка
df = pd.DataFrame(users_list, columns=columns)

print("Исходная таблица")
print(df)


print("Добавление данных")
# Запрашиваем данные для нового пользователя
new_fio = input("Введите ФИО: ")
new_address = input("Введите адрес: ")
new_phone = input("Введите телефон: ")
new_birthday = input("Введите дату рождения: ")

# Записываем новые данные в следующую пустую строку (индекс равен текущей длине таблицы)
df.loc[len(df)] = [new_fio, new_address, new_phone, new_birthday]

print("Таблица после добавления:")
print(df)


print("Редактирование данных")
# Запрашиваем у пользователя, что именно он хочет изменить
row_index = int(input("Введите номер строки для редактирования: "))
column_name = input("Введите название колонки (ФИО, Адрес, Телефон или Дата рождения): ")
new_value = input("Введите новое значение: ")

# Находит нужную ячейку и записывает туда новое значение
df.loc[row_index, column_name] = new_value

print("Таблица после изменения:")
print(df)


print("Удаление данных")
# Запрашиваем номер строки для удаления
delete_index = int(input("Введите номер строки для удаления: "))

# Удаляем строку по её номеру
df.drop(delete_index, inplace=True)
# Сбрасываем индексы, чтобы они снова шли по порядку (0, 1, 2...)
df.reset_index(drop=True, inplace=True)

print("Финальная таблица после удаления:")
print(df)